chore: update architecture, in_memory -> local_server
